### Pandas
- Series
- Data Frame
- Panel

In [1]:
import pandas as pd
pd.__version__

'0.24.2'

In [2]:
#Siries
#From list,tuple,dictionary
# From Numpy array
import numpy as np

In [3]:
a = np.array([1,2,3])

In [4]:
s = pd.Series(a)

In [5]:
s

0    1
1    2
2    3
dtype: int32

In [6]:
s1 = pd.Series([1,2,3],index=['I','II','III'])

In [8]:
print(s1[0])
print(s1['I'])

1
1

In [9]:
s1['I':'III']#By using index stop parameter included

I      1
II     2
III    3
dtype: int64

In [10]:
print(s1[0:2])

I     1
II    2
dtype: int64

In [12]:
s.index=['i1','i2','i3']

In [13]:
s

i1    1
i2    2
i3    3
dtype: int32

In [15]:
marks = {'maths':67,'Science':78,'English':56}
marks

{'maths': 67, 'Science': 78, 'English': 56}

In [16]:
pd.Series(marks)

maths      67
Science    78
English    56
dtype: int64

In [17]:
pd.date_range('2019-11-23','2019-11-30')#Like range but here stop value is included

DatetimeIndex(['2019-11-23', '2019-11-24', '2019-11-25', '2019-11-26',
               '2019-11-27', '2019-11-28', '2019-11-29', '2019-11-30'],
              dtype='datetime64[ns]', freq='D')

In [18]:
pd.date_range('2019-11-23',periods=5)

DatetimeIndex(['2019-11-23', '2019-11-24', '2019-11-25', '2019-11-26',
               '2019-11-27'],
              dtype='datetime64[ns]', freq='D')

In [19]:
temp = pd.Series([32,29,30,31],pd.date_range('2019-11-23',periods=4))

In [20]:
temp

2019-11-23    32
2019-11-24    29
2019-11-25    30
2019-11-26    31
Freq: D, dtype: int64

In [21]:
temp['2019-11-23']

32

In [22]:
temp.index

DatetimeIndex(['2019-11-23', '2019-11-24', '2019-11-25', '2019-11-26'], dtype='datetime64[ns]', freq='D')

In [23]:
s.index#Object nothing but string

Index(['i1', 'i2', 'i3'], dtype='object')

In [24]:
s1.index

Index(['I', 'II', 'III'], dtype='object')

In [25]:
pd.Series(np.arange(10))

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

DataFrame
- From a Dictionary
- From numpy 2D Array

In [27]:
studentmarks = {'Name':['Ram','Asha','Giri','mastan'],
               'maths':[23,44,53,78],
               'Science':[57,55,73,44],
               'English':[40,60,90,80]}
studentmarks

{'Name': ['Ram', 'Asha', 'Giri', 'mastan'],
 'maths': [23, 44, 53, 78],
 'Science': [57, 55, 73, 44],
 'English': [40, 60, 90, 80]}

In [29]:
stdf = pd.DataFrame(studentmarks)

In [30]:
stdf

     Name  maths  Science  English
0     Ram     23       57       40
1    Asha     44       55       60
2    Giri     53       73       90
3  mastan     78       44       80

In [34]:
a2 = np.array([['Ram',23,57,35,44],['Asha',54,66,78,39]])
pd.DataFrame(a2,columns=['Name','maths','Science','English','Telugu'],index=['std1','std2'])

      Name maths Science English Telugu
std1   Ram    23      57      35     44
std2  Asha    54      66      78     39

In [35]:
#pd.read_csv
pd.read_csv('DataFiles/marks.csv')

     'Ram'  23  57  35  44
0   'Asha'  54  66  78  39
1  'mastan  44  55  28  90

In [37]:
pd.read_csv('DataFiles/marks.csv',header = None)

         0   1   2   3   4
0    'Ram'  23  57  35  44
1   'Asha'  54  66  78  39
2  'mastan  44  55  28  90

In [38]:
pd.read_csv('DataFiles/marks.csv',header = 1)

    'Asha'  54  66  78  39
0  'mastan  44  55  28  90

In [41]:
pd.read_csv('DataFiles/marks.csv',names = ['Name','Telugu','English','Maths','Science'])

      Name  Telugu  English  Maths  Science
0    'Ram'      23       57     35       44
1   'Asha'      54       66     78       39
2  'mastan      44       55     28       90

In [42]:
help(pd.read_csv)

Help on function read_csv in module pandas.io.parsers:

read_csv(filepath_or_buffer, sep=',', delimiter=None, header='infer', names=None, index_col=None, usecols=None, squeeze=False, prefix=None, mangle_dupe_cols=True, dtype=None, engine=None, converters=None, true_values=None, false_values=None, skipinitialspace=False, skiprows=None, skipfooter=0, nrows=None, na_values=None, keep_default_na=True, na_filter=True, verbose=False, skip_blank_lines=True, parse_dates=False, infer_datetime_format=False, keep_date_col=False, date_parser=None, dayfirst=False, iterator=False, chunksize=None, compression='infer', thousands=None, decimal=b'.', lineterminator=None, quotechar='"', quoting=0, doublequote=True, escapechar=None, comment=None, encoding=None, dialect=None, tupleize_cols=None, error_bad_lines=True, warn_bad_lines=True, delim_whitespace=False, low_memory=True, memory_map=False, float_precision=None)
    Read a comma-separated values (csv) file into DataFrame.

    Also supports optionally iterating or breaking of the file
    into chunks.

    Additional help can be found in the online docs for
    `IO Tools <http://pandas.pydata.org/pandas-docs/stable/io.html>`_.

    Parameters
    ----------
    filepath_or_buffer : str, path object, or file-like object
        Any valid string path is acceptable. The string could be a URL. Valid
        URL schemes include http, ftp, s3, and file. For file URLs, a host is
        expected. A local file could be: file://localhost/path/to/table.csv.

        If you want to pass in a path object, pandas accepts either
        ``pathlib.Path`` or ``py._path.local.LocalPath``.

        By file-like object, we refer to objects with a ``read()`` method, such as
        a file handler (e.g. via builtin ``open`` function) or ``StringIO``.
    sep : str, default ','
        Delimiter to use. If sep is None, the C engine cannot automatically detect
        the separator, but the Python parsing engine can, meaning the latter will
        be used and automatically detect the separator by Python's builtin sniffer
        tool, ``csv.Sniffer``. In addition, separators longer than 1 character and
        different from ``'\s+'`` will be interpreted as regular expressions and
        will also force the use of the Python parsing engine. Note that regex
        delimiters are prone to ignoring quoted data. Regex example: ``'\r\t'``.
    delimiter : str, default ``None``
        Alias for sep.
    header : int, list of int, default 'infer'
        Row number(s) to use as the column names, and the start of the
        data.  Default behavior is to infer the column names: if no names
        are passed the behavior is identical to ``header=0`` and column
        names are inferred from the first line of the file, if column
        names are passed explicitly then the behavior is identical to
        ``header=None``. Explicitly pass ``header=0`` to be able to
        replace existing names. The header can be a list of integers that
        specify row locations for a multi-index on the columns
        e.g. [0,1,3]. Intervening rows that are not specified will be
        skipped (e.g. 2 in this example is skipped). Note that this
        parameter ignores commented lines and empty lines if
        ``skip_blank_lines=True``, so ``header=0`` denotes the first line of
        data rather than the first line of the file.
    names : array-like, optional
        List of column names to use. If file contains no header row, then you
        should explicitly pass ``header=None``. Duplicates in this list will cause
        a ``UserWarning`` to be issued.
    index_col : int, sequence or bool, optional
        Column to use as the row labels of the DataFrame. If a sequence is given, a
        MultiIndex is used. If you have a malformed file with delimiters at the end
        of each line, you might consider ``index_col=False`` to force pandas to
        not use the first column as the index (row names).
    usecols : list-like or callable, optional
        Return a subset of the columns. If list-like, all elements must either
        be positional (i.e. integer indices into the document columns) or strings
        that correspond to column names provided either by the user in `names` or
        inferred from the document header row(s). For example, a valid list-like
        `usecols` parameter would be ``[0, 1, 2]`` or ``['foo', 'bar', 'baz']``.
        Element order is ignored, so ``usecols=[0, 1]`` is the same as ``[1, 0]``.
        To instantiate a DataFrame from ``data`` with element order preserved use
        ``pd.read_csv(data, usecols=['foo', 'bar'])[['foo', 'bar']]`` for columns
        in ``['foo', 'bar']`` order or
        ``pd.read_csv(data, usecols=['foo', 'bar'])[['bar', 'foo']]``
        for ``['bar', 'foo']`` order.

        If callable, the callable function will be evaluated against the column
        names, returning names where the callable function evaluates to True. An
        example of a valid callable argument would be ``lambda x: x.upper() in
        ['AAA', 'BBB', 'DDD']``. Using this parameter results in much faster
        parsing time and lower memory usage.
    squeeze : bool, default False
        If the parsed data only contains one column then return a Series.
    prefix : str, optional
        Prefix to add to column numbers when no header, e.g. 'X' for X0, X1, ...
    mangle_dupe_cols : bool, default True
        Duplicate columns will be specified as 'X', 'X.1', ...'X.N', rather than
        'X'...'X'. Passing in False will cause data to be overwritten if there
        are duplicate names in the columns.
    dtype : Type name or dict of column -> type, optional
        Data type for data or columns. E.g. {'a': np.float64, 'b': np.int32,
        'c': 'Int64'}
        Use `str` or `object` together with suitable `na_values` settings
        to preserve and not interpret dtype.
        If converters are specified, they will be applied INSTEAD
        of dtype conversion.
    engine : {'c', 'python'}, optional
        Parser engine to use. The C engine is faster while the python engine is
        currently more feature-complete.
    converters : dict, optional
        Dict of functions for converting values in certain columns. Keys can either
        be integers or column labels.
    true_values : list, optional
        Values to consider as True.
    false_values : list, optional
        Values to consider as False.
    skipinitialspace : bool, default False
        Skip spaces after delimiter.
    skiprows : list-like, int or callable, optional
        Line numbers to skip (0-indexed) or number of lines to skip (int)
        at the start of the file.

        If callable, the callable function will be evaluated against the row
        indices, returning True if the row should be skipped and False otherwise.
        An example of a valid callable argument would be ``lambda x: x in [0, 2]``.
    skipfooter : int, default 0
        Number of lines at bottom of file to skip (Unsupported with engine='c').
    nrows : int, optional
        Number of rows of file to read. Useful for reading pieces of large files.
    na_values : scalar, str, list-like, or dict, optional
        Additional strings to recognize as NA/NaN. If dict passed, specific
        per-column NA values.  By default the following values are interpreted as
        NaN: '', '#N/A', '#N/A N/A', '#NA', '-1.#IND', '-1.#QNAN', '-NaN', '-nan',
        '1.#IND', '1.#QNAN', 'N/A', 'NA', 'NULL', 'NaN', 'n/a', 'nan',
        'null'.
    keep_default_na : bool, default True
        Whether or not to include the default NaN values when parsing the data.
        Depending on whether `na_values` is passed in, the behavior is as follows:

        * If `keep_default_na` is True, and `na_values` are specified, `na_values`
          is appended to the default NaN values used for parsing.
        * If `keep_default_na` is True, and `na_values` are not specified, only
          the default NaN values are used for parsing.
        * If `keep_default_na` is False, and `na_values` are specified, only
          the NaN values specified `na_values` are used for parsing.
        * If `keep_default_na` is False, and `na_values` are not specified, no
          strings will be parsed as NaN.

        Note that if `na_filter` is passed in as False, the `keep_default_na` and
        `na_values` parameters will be ignored.
    na_filter : bool, default True
        Detect missing value markers (empty strings and the value of na_values). In
        data without any NAs, passing na_filter=False can improve the performance
        of reading a large file.
    verbose : bool, default False
        Indicate number of NA values placed in non-numeric columns.
    skip_blank_lines : bool, default True
        If True, skip over blank lines rather than interpreting as NaN values.
    parse_dates : bool or list of int or names or list of lists or dict, default False
        The behavior is as follows:

        * boolean. If True -> try parsing the index.
        * list of int or names. e.g. If [1, 2, 3] -> try parsing columns 1, 2, 3
          each as a separate date column.
        * list of lists. e.g.  If [[1, 3]] -> combine columns 1 and 3 and parse as
          a single date column.
        * dict, e.g. {'foo' : [1, 3]} -> parse columns 1, 3 as date and call
          result 'foo'

        If a column or index cannot be represented as an array of datetimes,
        say because of an unparseable value or a mixture of timezones, the column
        or index will be returned unaltered as an object data type. For
        non-standard datetime parsing, use ``pd.to_datetime`` after
        ``pd.read_csv``. To parse an index or column with a mixture of timezones,
        specify ``date_parser`` to be a partially-applied
        :func:`pandas.to_datetime` with ``utc=True``. See
        :ref:`io.csv.mixed_timezones` for more.

        Note: A fast-path exists for iso8601-formatted dates.
    infer_datetime_format : bool, default False
        If True and `parse_dates` is enabled, pandas will attempt to infer the
        format of the datetime strings in the columns, and if it can be inferred,
        switch to a faster method of parsing them. In some cases this can increase
        the parsing speed by 5-10x.
    keep_date_col : bool, default False
        If True and `parse_dates` specifies combining multiple columns then
        keep the original columns.
    date_parser : function, optional
        Function to use for converting a sequence of string columns to an array of
        datetime instances. The default uses ``dateutil.parser.parser`` to do the
        conversion. Pandas will try to call `date_parser` in three different ways,
        advancing to the next if an exception occurs: 1) Pass one or more arrays
        (as defined by `parse_dates`) as arguments; 2) concatenate (row-wise) the
        string values from the columns defined by `parse_dates` into a single array
        and pass that; and 3) call `date_parser` once for each row using one or
        more strings (corresponding to the columns defined by `parse_dates`) as
        arguments.
    dayfirst : bool, default False
        DD/MM format dates, international and European format.
    iterator : bool, default False
        Return TextFileReader object for iteration or getting chunks with
        ``get_chunk()``.
    chunksize : int, optional
        Return TextFileReader object for iteration.
        See the `IO Tools docs
        <http://pandas.pydata.org/pandas-docs/stable/io.html#io-chunking>`_
        for more information on ``iterator`` and ``chunksize``.
    compression : {'infer', 'gzip', 'bz2', 'zip', 'xz', None}, default 'infer'
        For on-the-fly decompression of on-disk data. If 'infer' and
        `filepath_or_buffer` is path-like, then detect compression from the
        following extensions: '.gz', '.bz2', '.zip', or '.xz' (otherwise no
        decompression). If using 'zip', the ZIP file must contain only one data
        file to be read in. Set to None for no decompression.

        .. versionadded:: 0.18.1 support for 'zip' and 'xz' compression.

    thousands : str, optional
        Thousands separator.
    decimal : str, default '.'
        Character to recognize as decimal point (e.g. use ',' for European data).
    lineterminator : str (length 1), optional
        Character to break file into lines. Only valid with C parser.
    quotechar : str (length 1), optional
        The character used to denote the start and end of a quoted item. Quoted
        items can include the delimiter and it will be ignored.
    quoting : int or csv.QUOTE_* instance, default 0
        Control field quoting behavior per ``csv.QUOTE_*`` constants. Use one of
        QUOTE_MINIMAL (0), QUOTE_ALL (1), QUOTE_NONNUMERIC (2) or QUOTE_NONE (3).
    doublequote : bool, default ``True``
       When quotechar is specified and quoting is not ``QUOTE_NONE``, indicate
       whether or not to interpret two consecutive quotechar elements INSIDE a
       field as a single ``quotechar`` element.
    escapechar : str (length 1), optional
        One-character string used to escape other characters.
    comment : str, optional
        Indicates remainder of line should not be parsed. If found at the beginning
        of a line, the line will be ignored altogether. This parameter must be a
        single character. Like empty lines (as long as ``skip_blank_lines=True``),
        fully commented lines are ignored by the parameter `header` but not by
        `skiprows`. For example, if ``comment='#'``, parsing
        ``#empty\na,b,c\n1,2,3`` with ``header=0`` will result in 'a,b,c' being
        treated as the header.
    encoding : str, optional
        Encoding to use for UTF when reading/writing (ex. 'utf-8'). `List of Python
        standard encodings
        <https://docs.python.org/3/library/codecs.html#standard-encodings>`_ .
    dialect : str or csv.Dialect, optional
        If provided, this parameter will override values (default or not) for the
        following parameters: `delimiter`, `doublequote`, `escapechar`,
        `skipinitialspace`, `quotechar`, and `quoting`. If it is necessary to
        override values, a ParserWarning will be issued. See csv.Dialect
        documentation for more details.
    tupleize_cols : bool, default False
        Leave a list of tuples on columns as is (default is to convert to
        a MultiIndex on the columns).

        .. deprecated:: 0.21.0
           This argument will be removed and will always convert to MultiIndex

    error_bad_lines : bool, default True
        Lines with too many fields (e.g. a csv line with too many commas) will by
        default cause an exception to be raised, and no DataFrame will be returned.
        If False, then these "bad lines" will dropped from the DataFrame that is
        returned.
    warn_bad_lines : bool, default True
        If error_bad_lines is False, and warn_bad_lines is True, a warning for each
        "bad line" will be output.
    delim_whitespace : bool, default False
        Specifies whether or not whitespace (e.g. ``' '`` or ``'    '``) will be
        used as the sep. Equivalent to setting ``sep='\s+'``. If this option
        is set to True, nothing should be passed in for the ``delimiter``
        parameter.

        .. versionadded:: 0.18.1 support for the Python parser.

    low_memory : bool, default True
        Internally process the file in chunks, resulting in lower memory use
        while parsing, but possibly mixed type inference.  To ensure no mixed
        types either set False, or specify the type with the `dtype` parameter.
        Note that the entire file is read into a single DataFrame regardless,
        use the `chunksize` or `iterator` parameter to return the data in chunks.
        (Only valid with C parser).
    memory_map : bool, default False
        If a filepath is provided for `filepath_or_buffer`, map the file object
        directly onto memory and access the data directly from there. Using this
        option can improve performance because there is no longer any I/O overhead.
    float_precision : str, optional
        Specifies which converter the C engine should use for floating-point
        values. The options are `None` for the ordinary converter,
        `high` for the high-precision converter, and `round_trip` for the
        round-trip converter.

    Returns
    -------
    DataFrame or TextParser
        A comma-separated values (csv) file is returned as two-dimensional
        data structure with labeled axes.

    See Also
    --------
    to_csv : Write DataFrame to a comma-separated values (csv) file.
    read_csv : Read a comma-separated values (csv) file into DataFrame.
    read_fwf : Read a table of fixed-width formatted lines into DataFrame.

    Examples
    --------
    >>> pd.read_csv('data.csv')  # doctest: +SKIP

In [48]:
pd.read_csv('DataFiles/marks.csv',\
            names = ['Name','Telugu','English','Maths','Science'],usecols=['Name','Telugu'])

      Name  Telugu
0    'Ram'      23
1   'Asha'      54
2  'mastan      44

In [74]:
df=pd.read_csv('DataFiles/marks.csv',\
            names = ['Student Name','Telugu','English','Maths','Science'])

In [52]:
df

      Name  Telugu  English  Maths  Science
0    'Ram'      23       57   35.0       44
1   'Asha'      54       66    NaN       39
2  'mastan      44       55   28.0       90

In [56]:
df['Student Name']

0      'Ram'
1     'Asha'
2    'mastan
Name: Student Name, dtype: object

In [57]:
df.Student Name

SyntaxError: invalid syntax (<ipython-input-57-91bbe0eaec73>, line 1)

In [58]:
df.columns

Index(['Student Name', 'Telugu', 'English', 'Maths', 'Science'], dtype='object')

In [59]:
df[['Student Name']]

  Student Name
0        'Ram'
1       'Asha'
2      'mastan

In [60]:
df[['Student Name','Telugu']]

  Student Name  Telugu
0        'Ram'      23
1       'Asha'      54
2      'mastan      44

In [61]:
df.values

array([["'Ram'", 23, 57, 35.0, 44],
       ["'Asha'", 54, 66, nan, 39],
       ["'mastan", 44, 55, 28.0, 90]], dtype=object)

In [62]:
df.columns

Index(['Student Name', 'Telugu', 'English', 'Maths', 'Science'], dtype='object')

In [63]:
df.dtypes#Datatype of each element

Student Name     object
Telugu            int64
English           int64
Maths           float64
Science           int64
dtype: object

In [64]:
df.index#Row indices

RangeIndex(start=0, stop=3, step=1)

In [65]:
df.shape# tuple of no of rows and columns

(3, 5)

In [67]:
#number of rows
print(df.shape[0])
#number of columns
print(df.shape[1])

3
5

In [75]:
df

  Student Name  Telugu  English  Maths  Science
0        'Ram'      23       57   35.0       44
1       'Asha'      54       66    NaN       39
2      'mastan      44       55   28.0       90
3       'Ravi'      77       40   87.0       67
4       'Suma'      80       58   39.0       50
5      'Rohan'      80       40   38.0       90
6      'Raman'      59       39   40.0       50
7      'Basha'      65       34   78.0       90
8  'Charishma'      40       58   90.0       30

Indexing
- Position based Indexing(iloc)
- Label based Indexing(loc)

In [70]:
df['Student Name']

0          'Ram'
1         'Asha'
2        'mastan
3         'Ravi'
4       'Suma'80
5        'Rohan'
6        'Raman'
7        'Basha'
8    'Charishma'
Name: Student Name, dtype: object

In [76]:
#df.iloc
df.iloc[4,0:2]

Student Name    'Suma'
Telugu              80
Name: 4, dtype: object

In [77]:
df.iloc[4:6,:]

  Student Name  Telugu  English  Maths  Science
4       'Suma'      80       58   39.0       50
5      'Rohan'      80       40   38.0       90

In [78]:
df.iloc[2,3]

28.0

In [79]:
df.iloc[2,:]

Student Name    'mastan
Telugu               44
English              55
Maths                28
Science              90
Name: 2, dtype: object

In [80]:
df.iloc[:,1]

0    23
1    54
2    44
3    77
4    80
5    80
6    59
7    65
8    40
Name: Telugu, dtype: int64

In [81]:
df.iloc[[1,3,6],[2,0,1]]

   English Student Name  Telugu
1       66       'Asha'      54
3       40       'Ravi'      77
6       39      'Raman'      59

In [82]:
#loc
df.loc[0,'Student Name']

"'Ram'"

In [85]:
df.loc[2:4,'Student Name']

2    'mastan
3     'Ravi'
4     'Suma'
Name: Student Name, dtype: object

In [87]:
df.loc[2:4,'Student Name':'English']

  Student Name  Telugu  English
2      'mastan      44       55
3       'Ravi'      77       40
4       'Suma'      80       58

In [88]:
df[['Student Name','Science']]

  Student Name  Science
0        'Ram'       44
1       'Asha'       39
2      'mastan       90
3       'Ravi'       67
4       'Suma'       50
5      'Rohan'       90
6      'Raman'       50
7      'Basha'       90
8  'Charishma'       30

In [91]:
df1 = df.set_index('Student Name')

In [92]:
df1

              Telugu  English  Maths  Science
Student Name
'Ram'             23       57   35.0       44
'Asha'            54       66    NaN       39
'mastan           44       55   28.0       90
'Ravi'            77       40   87.0       67
'Suma'            80       58   39.0       50
'Rohan'           80       40   38.0       90
'Raman'           59       39   40.0       50
'Basha'           65       34   78.0       90
'Charishma'       40       58   90.0       30

In [100]:
df1.loc["'Ram'"]

Telugu     23.0
English    57.0
Maths      35.0
Science    44.0
Name: 'Ram', dtype: float64

In [101]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
Student Name    9 non-null object
Telugu          9 non-null int64
English         9 non-null int64
Maths           8 non-null float64
Science         9 non-null int64
dtypes: float64(1), int64(3), object(1)
memory usage: 440.0+ bytes

In [103]:
df['Total'] = df['Telugu']+df['English']+df['Maths']+df['Science']

In [104]:
df

  Student Name  Telugu  English  Maths  Science  Total
0        'Ram'      23       57   35.0       44  159.0
1       'Asha'      54       66    NaN       39    NaN
2      'mastan      44       55   28.0       90  217.0
3       'Ravi'      77       40   87.0       67  271.0
4       'Suma'      80       58   39.0       50  227.0
5      'Rohan'      80       40   38.0       90  248.0
6      'Raman'      59       39   40.0       50  188.0
7      'Basha'      65       34   78.0       90  267.0
8  'Charishma'      40       58   90.0       30  218.0

In [107]:
df.describe

<bound method NDFrame.describe of   Student Name  Telugu  English  Maths  Science  Total
0        'Ram'      23       57   35.0       44  159.0
1       'Asha'      54       66    NaN       39    NaN
2      'mastan      44       55   28.0       90  217.0
3       'Ravi'      77       40   87.0       67  271.0
4       'Suma'      80       58   39.0       50  227.0
5      'Rohan'      80       40   38.0       90  248.0
6      'Raman'      59       39   40.0       50  188.0
7      'Basha'      65       34   78.0       90  267.0
8  'Charishma'      40       58   90.0       30  218.0>

In [108]:
df.describe()

          Telugu    English      Maths    Science      Total
count   9.000000   9.000000   8.000000   9.000000    8.00000
mean   58.000000  49.666667  54.375000  61.111111  224.37500
std    19.811613  11.368817  25.839823  23.808845   38.26202
min    23.000000  34.000000  28.000000  30.000000  159.00000
25%    44.000000  40.000000  37.250000  44.000000  209.75000
50%    59.000000  55.000000  39.500000  50.000000  222.50000
75%    77.000000  58.000000  80.250000  90.000000  252.75000
max    80.000000  66.000000  90.000000  90.000000  271.00000

In [109]:
df.describe(include=object)

       Student Name
count             9
unique            9
top          'Asha'
freq              1

In [111]:
df.describe(include=np.int64)

          Telugu    English    Science
count   9.000000   9.000000   9.000000
mean   58.000000  49.666667  61.111111
std    19.811613  11.368817  23.808845
min    23.000000  34.000000  30.000000
25%    44.000000  40.000000  44.000000
50%    59.000000  55.000000  50.000000
75%    77.000000  58.000000  90.000000
max    80.000000  66.000000  90.000000

In [128]:
sdf = pd.read_csv('DataFiles/Student.csv',names = ['Student Name','College','Course'])
sdf

  Student Name College            Course
0        'Ram'    IIIT   Machine Leaning
1       'Asha'    SVCE            Python
2      'mastan    SRKR      Data Science
3       'Ravi'    SRKR      Data Science
4       'Suma'    IIIT      Data Science
5      'Name1'    SVEC  Machine Learning
6      'Name2'    IIIT      Data Science
7      'Name3'  Lenora            Python

Check these
- head
- tail
- shape
- Coulumns
- dtype
- index
- info
- describe

In [124]:
sdf.head()

  Student Name College           Course
0        'Ram'    IIIT  Machine Leaning
1       'Asha'    SVCE           Python
2      'mastan    SRKR     Data Science
3       'Ravi'    SRKR     Data Science
4       'Suma'    IIIT     Data Science

In [126]:
sdf.tail()

  Student Name College            Course
3       'Ravi'    SRKR      Data Science
4       'Suma'    IIIT      Data Science
5      'Name1'    SVEC  Machine Learning
6      'Name2'    IIIT      Data Science
7      'Name3'  Lenora            Python

In [116]:
sdf.shape

(8, 3)

In [117]:
sdf.columns

Index(['Student Name', 'College', 'Course'], dtype='object')

In [118]:
sdf.dtypes

Student Name    object
College         object
Course          object
dtype: object

In [119]:
sdf.index

RangeIndex(start=0, stop=8, step=1)

In [121]:
sdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
Student Name    8 non-null object
College         8 non-null object
Course          8 non-null object
dtypes: object(3)
memory usage: 272.0+ bytes

In [122]:
sdf.describe()

       Student Name College        Course
count             8       8             8
unique            8       5             4
top         'Name1'    IIIT  Data Science
freq              1       3             4

In [130]:
sdf.nunique()

Student Name    8
College         5
Course          4
dtype: int64

In [131]:
sdf.College.value_counts()

IIIT      3
SRKR      2
SVEC      1
Lenora    1
SVCE      1
Name: College, dtype: int64

In [133]:
#pd.merge
pd.merge(df,sdf,on='Student Name',how = 'inner')#Intersection format defalut inner it will take

,Student Name,Telugu,English,Maths,Science,Total,College,Course
0,'Ram',23,57,35.0,44,159.0,IIIT,Machine Leaning
1,'Asha',54,66,NaN,39,NaN,SVCE,Python
2,'mastan,44,55,28.0,90,217.0,SRKR,Data Science
3,'Ravi',77,40,87.0,67,271.0,SRKR,Data Science
4,'Suma',80,58,39.0,50,227.0,IIIT,Data Science

In [134]:
pd.merge(df,sdf,on='Student Name',how = 'outer')

,Student Name,Telugu,English,Maths,Science,Total,College,Course
0,'Ram',23.0,57.0,35.0,44.0,159.0,IIIT,Machine Leaning
1,'Asha',54.0,66.0,NaN,39.0,NaN,SVCE,Python
2,'mastan,44.0,55.0,28.0,90.0,217.0,SRKR,Data Science
3,'Ravi',77.0,40.0,87.0,67.0,271.0,SRKR,Data Science
4,'Suma',80.0,58.0,39.0,50.0,227.0,IIIT,Data Science
5,'Rohan',80.0,40.0,38.0,90.0,248.0,NaN,NaN
6,'Raman',59.0,39.0,40.0,50.0,188.0,NaN,NaN
7,'Basha',65.0,34.0,78.0,90.0,267.0,NaN,NaN
8,'Charishma',40.0,58.0,90.0,30.0,218.0,NaN,NaN
9,'Name1',NaN,NaN,NaN,NaN,NaN,SVEC,Machine Learning
10,'Name2',NaN,NaN,NaN,NaN,NaN,IIIT,Data Science
11,'Name3',NaN,NaN,NaN,NaN,NaN,Lenora,Python

In [135]:
pd.merge(df,sdf,on='Student Name',how = 'left')#It access only df dataframe(i.e left)

,Student Name,Telugu,English,Maths,Science,Total,College,Course
0,'Ram',23,57,35.0,44,159.0,IIIT,Machine Leaning
1,'Asha',54,66,NaN,39,NaN,SVCE,Python
2,'mastan,44,55,28.0,90,217.0,SRKR,Data Science
3,'Ravi',77,40,87.0,67,271.0,SRKR,Data Science
4,'Suma',80,58,39.0,50,227.0,IIIT,Data Science
5,'Rohan',80,40,38.0,90,248.0,NaN,NaN
6,'Raman',59,39,40.0,50,188.0,NaN,NaN
7,'Basha',65,34,78.0,90,267.0,NaN,NaN
8,'Charishma',40,58,90.0,30,218.0,NaN,NaN

In [136]:
pd.merge(df,sdf,on='Student Name',how = 'right')#It Access only sdf dataframe (i.e right)

,Student Name,Telugu,English,Maths,Science,Total,College,Course
0,'Ram',23.0,57.0,35.0,44.0,159.0,IIIT,Machine Leaning
1,'Asha',54.0,66.0,NaN,39.0,NaN,SVCE,Python
2,'mastan,44.0,55.0,28.0,90.0,217.0,SRKR,Data Science
3,'Ravi',77.0,40.0,87.0,67.0,271.0,SRKR,Data Science
4,'Suma',80.0,58.0,39.0,50.0,227.0,IIIT,Data Science
5,'Name1',NaN,NaN,NaN,NaN,NaN,SVEC,Machine Learning
6,'Name2',NaN,NaN,NaN,NaN,NaN,IIIT,Data Science
7,'Name3',NaN,NaN,NaN,NaN,NaN,Lenora,Python

Boolean or Fancy Indexing

In [137]:
df['Maths']>60

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7     True
8     True
Name: Maths, dtype: bool

In [138]:
df[df['Maths']>60]

  Student Name  Telugu  English  Maths  Science  Total
3       'Ravi'      77       40   87.0       67  271.0
7      'Basha'      65       34   78.0       90  267.0
8  'Charishma'      40       58   90.0       30  218.0

In [141]:
df[(df['Maths']>60) & (df['Maths']<80)]

  Student Name  Telugu  English  Maths  Science  Total
7      'Basha'      65       34   78.0       90  267.0

In [142]:
df[(df['Maths']>60) & (df['English']<80)]

  Student Name  Telugu  English  Maths  Science  Total
3       'Ravi'      77       40   87.0       67  271.0
7      'Basha'      65       34   78.0       90  267.0
8  'Charishma'      40       58   90.0       30  218.0

In [143]:
df[(df['Maths']>60) & (df['English']<80)]['Science']

3    67
7    90
8    30
Name: Science, dtype: int64

In [148]:
df['Science'][(df['Maths']>60) & (df['English']<80)]

3    67
7    90
8    30
Name: Science, dtype: int64

In [149]:
sdf[sdf['Course'] == 'Machine Learning']

  Student Name College            Course
5      'Name1'    SVEC  Machine Learning

In [150]:
sdf[sdf['College'] == 'IIIT']

  Student Name College           Course
0        'Ram'    IIIT  Machine Leaning
4       'Suma'    IIIT     Data Science
6      'Name2'    IIIT     Data Science

In [154]:
sdf[sdf['Course'] == 'Data Science']

  Student Name College        Course
2      'mastan    SRKR  Data Science
3       'Ravi'    SRKR  Data Science
4       'Suma'    IIIT  Data Science
6      'Name2'    IIIT  Data Science

Sorting

In [155]:
df.sort_values('Maths')

  Student Name  Telugu  English  Maths  Science  Total
2      'mastan      44       55   28.0       90  217.0
0        'Ram'      23       57   35.0       44  159.0
5      'Rohan'      80       40   38.0       90  248.0
4       'Suma'      80       58   39.0       50  227.0
6      'Raman'      59       39   40.0       50  188.0
7      'Basha'      65       34   78.0       90  267.0
3       'Ravi'      77       40   87.0       67  271.0
8  'Charishma'      40       58   90.0       30  218.0
1       'Asha'      54       66    NaN       39    NaN

In [156]:
df.sort_values('Maths',ascending=False)

  Student Name  Telugu  English  Maths  Science  Total
8  'Charishma'      40       58   90.0       30  218.0
3       'Ravi'      77       40   87.0       67  271.0
7      'Basha'      65       34   78.0       90  267.0
6      'Raman'      59       39   40.0       50  188.0
4       'Suma'      80       58   39.0       50  227.0
5      'Rohan'      80       40   38.0       90  248.0
0        'Ram'      23       57   35.0       44  159.0
2      'mastan      44       55   28.0       90  217.0
1       'Asha'      54       66    NaN       39    NaN

In [157]:
df.sort_values('Student Name')

  Student Name  Telugu  English  Maths  Science  Total
1       'Asha'      54       66    NaN       39    NaN
7      'Basha'      65       34   78.0       90  267.0
8  'Charishma'      40       58   90.0       30  218.0
0        'Ram'      23       57   35.0       44  159.0
6      'Raman'      59       39   40.0       50  188.0
3       'Ravi'      77       40   87.0       67  271.0
5      'Rohan'      80       40   38.0       90  248.0
4       'Suma'      80       58   39.0       50  227.0
2      'mastan      44       55   28.0       90  217.0

In [158]:
df.sort_values('Total',ascending=False)

  Student Name  Telugu  English  Maths  Science  Total
3       'Ravi'      77       40   87.0       67  271.0
7      'Basha'      65       34   78.0       90  267.0
5      'Rohan'      80       40   38.0       90  248.0
4       'Suma'      80       58   39.0       50  227.0
8  'Charishma'      40       58   90.0       30  218.0
2      'mastan      44       55   28.0       90  217.0
6      'Raman'      59       39   40.0       50  188.0
0        'Ram'      23       57   35.0       44  159.0
1       'Asha'      54       66    NaN       39    NaN

In [159]:
df1

              Telugu  English  Maths  Science
Student Name
'Ram'             23       57   35.0       44
'Asha'            54       66    NaN       39
'mastan           44       55   28.0       90
'Ravi'            77       40   87.0       67
'Suma'            80       58   39.0       50
'Rohan'           80       40   38.0       90
'Raman'           59       39   40.0       50
'Basha'           65       34   78.0       90
'Charishma'       40       58   90.0       30

In [160]:
df1.sort_index()

              Telugu  English  Maths  Science
Student Name
'Asha'            54       66    NaN       39
'Basha'           65       34   78.0       90
'Charishma'       40       58   90.0       30
'Ram'             23       57   35.0       44
'Raman'           59       39   40.0       50
'Ravi'            77       40   87.0       67
'Rohan'           80       40   38.0       90
'Suma'            80       58   39.0       50
'mastan           44       55   28.0       90

Missing Values

In [161]:
df.isnull()

   Student Name  Telugu  English  Maths  Science  Total
0         False   False    False  False    False  False
1         False   False    False   True    False   True
2         False   False    False  False    False  False
3         False   False    False  False    False  False
4         False   False    False  False    False  False
5         False   False    False  False    False  False
6         False   False    False  False    False  False
7         False   False    False  False    False  False
8         False   False    False  False    False  False

In [162]:
df.isna()

   Student Name  Telugu  English  Maths  Science  Total
0         False   False    False  False    False  False
1         False   False    False   True    False   True
2         False   False    False  False    False  False
3         False   False    False  False    False  False
4         False   False    False  False    False  False
5         False   False    False  False    False  False
6         False   False    False  False    False  False
7         False   False    False  False    False  False
8         False   False    False  False    False  False

In [163]:
df[df.isna()]

  Student Name  Telugu  English  Maths  Science  Total
0          NaN     NaN      NaN    NaN      NaN    NaN
1          NaN     NaN      NaN    NaN      NaN    NaN
2          NaN     NaN      NaN    NaN      NaN    NaN
3          NaN     NaN      NaN    NaN      NaN    NaN
4          NaN     NaN      NaN    NaN      NaN    NaN
5          NaN     NaN      NaN    NaN      NaN    NaN
6          NaN     NaN      NaN    NaN      NaN    NaN
7          NaN     NaN      NaN    NaN      NaN    NaN
8          NaN     NaN      NaN    NaN      NaN    NaN

In [168]:
df.isnull().sum()

Student Name    0
Telugu          0
English         0
Maths           1
Science         0
Total           1
dtype: int64

In [175]:
print(df.Science.min())
print(df.Science.max())
print(df.Science.mean())
print(df.Science.median())
print(df.Science.mode())

30
90
61.111111111111114
50.0
0    90
dtype: int64

In [176]:
df.Science.value_counts()

90    3
50    2
30    1
44    1
39    1
67    1
Name: Science, dtype: int64

In [178]:
df['Science'].fillna(df['Science'].mean())

0    44
1    39
2    90
3    67
4    50
5    90
6    50
7    90
8    30
Name: Science, dtype: int64

In [180]:
df['Maths'].isnull()

0    False
1     True
2    False
3    False
4    False
5    False
6    False
7    False
8    False
Name: Maths, dtype: bool

In [ ]:
#if you want to delete the missing value row 
df.dropna()
df.dropna(axis=1)

In [ ]:
#IF you want to drop the column name
df.drop('Maths',axis=1)

In [ ]:
#If you want to drop the row
df.drop("'Ram'")#here no need to specify the axis because default axis = 0

In [181]:
final_df = pd.merge(df,sdf,how = 'outer')

In [182]:
final_df

,Student Name,Telugu,English,Maths,Science,Total,College,Course
0,'Ram',23.0,57.0,35.0,44.0,159.0,IIIT,Machine Leaning
1,'Asha',54.0,66.0,NaN,39.0,NaN,SVCE,Python
2,'mastan,44.0,55.0,28.0,90.0,217.0,SRKR,Data Science
3,'Ravi',77.0,40.0,87.0,67.0,271.0,SRKR,Data Science
4,'Suma',80.0,58.0,39.0,50.0,227.0,IIIT,Data Science
5,'Rohan',80.0,40.0,38.0,90.0,248.0,NaN,NaN
6,'Raman',59.0,39.0,40.0,50.0,188.0,NaN,NaN
7,'Basha',65.0,34.0,78.0,90.0,267.0,NaN,NaN
8,'Charishma',40.0,58.0,90.0,30.0,218.0,NaN,NaN
9,'Name1',NaN,NaN,NaN,NaN,NaN,SVEC,Machine Learning
10,'Name2',NaN,NaN,NaN,NaN,NaN,IIIT,Data Science
11,'Name3',NaN,NaN,NaN,NaN,NaN,Lenora,Python

In [183]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12 entries, 0 to 11
Data columns (total 8 columns):
Student Name    12 non-null object
Telugu          9 non-null float64
English         9 non-null float64
Maths           8 non-null float64
Science         9 non-null float64
Total           8 non-null float64
College         8 non-null object
Course          8 non-null object
dtypes: float64(5), object(3)
memory usage: 864.0+ bytes

In [184]:
final_df.isnull()

    Student Name  Telugu  English  Maths  Science  Total  College  Course
0          False   False    False  False    False  False    False   False
1          False   False    False   True    False   True    False   False
2          False   False    False  False    False  False    False   False
3          False   False    False  False    False  False    False   False
4          False   False    False  False    False  False    False   False
5          False   False    False  False    False  False     True    True
6          False   False    False  False    False  False     True    True
7          False   False    False  False    False  False     True    True
8          False   False    False  False    False  False     True    True
9          False    True     True   True     True   True    False   False
10         False    True     True   True     True   True    False   False
11         False    True     True   True     True   True    False   False

In [186]:
final_df.isnull().sum()

Student Name    0
Telugu          3
English         3
Maths           4
Science         3
Total           4
College         4
Course          4
dtype: int64

In [187]:
final_df.columns

Index(['Student Name', 'Telugu', 'English', 'Maths', 'Science', 'Total',
       'College', 'Course'],
      dtype='object')

In [188]:
final_df.dtypes

Student Name     object
Telugu          float64
English         float64
Maths           float64
Science         float64
Total           float64
College          object
Course           object
dtype: object

In [190]:
final_df.dtypes != object

Student Name    False
Telugu           True
English          True
Maths            True
Science          True
Total            True
College         False
Course          False
dtype: bool

In [192]:
final_df.columns[final_df.dtypes != object]

Index(['Telugu', 'English', 'Maths', 'Science', 'Total'], dtype='object')

In [195]:
final_df.describe().columns

Index(['Telugu', 'English', 'Maths', 'Science', 'Total'], dtype='object')

In [196]:
final_df.columns[final_df.dtypes == object]

Index(['Student Name', 'College', 'Course'], dtype='object')

In [197]:
cat_cols = final_df.describe(include=object).columns
num_cols = final_df.columns[final_df.dtypes != object]

In [198]:
print(cat_cols)
print(num_cols)

Index(['Student Name', 'College', 'Course'], dtype='object')
Index(['Telugu', 'English', 'Maths', 'Science', 'Total'], dtype='object')

In [200]:
print(final_df.College.mode())

0    IIIT
dtype: object

In [201]:
final_df

,Student Name,Telugu,English,Maths,Science,Total,College,Course
0,'Ram',23.0,57.0,35.0,44.0,159.0,IIIT,Machine Leaning
1,'Asha',54.0,66.0,NaN,39.0,NaN,SVCE,Python
2,'mastan,44.0,55.0,28.0,90.0,217.0,SRKR,Data Science
3,'Ravi',77.0,40.0,87.0,67.0,271.0,SRKR,Data Science
4,'Suma',80.0,58.0,39.0,50.0,227.0,IIIT,Data Science
5,'Rohan',80.0,40.0,38.0,90.0,248.0,NaN,NaN
6,'Raman',59.0,39.0,40.0,50.0,188.0,NaN,NaN
7,'Basha',65.0,34.0,78.0,90.0,267.0,NaN,NaN
8,'Charishma',40.0,58.0,90.0,30.0,218.0,NaN,NaN
9,'Name1',NaN,NaN,NaN,NaN,NaN,SVEC,Machine Learning
10,'Name2',NaN,NaN,NaN,NaN,NaN,IIIT,Data Science
11,'Name3',NaN,NaN,NaN,NaN,NaN,Lenora,Python

Numerical Columns

In [204]:
for col in num_cols:
    final_df['Maths'].fillna(final_df['Maths'].mean(),inplace = True)

In [205]:
final_df

,Student Name,Telugu,English,Maths,Science,Total,College,Course
0,'Ram',23.0,57.0,35.000,44.0,159.0,IIIT,Machine Leaning
1,'Asha',54.0,66.0,54.375,39.0,NaN,SVCE,Python
2,'mastan,44.0,55.0,28.000,90.0,217.0,SRKR,Data Science
3,'Ravi',77.0,40.0,87.000,67.0,271.0,SRKR,Data Science
4,'Suma',80.0,58.0,39.000,50.0,227.0,IIIT,Data Science
5,'Rohan',80.0,40.0,38.000,90.0,248.0,NaN,NaN
6,'Raman',59.0,39.0,40.000,50.0,188.0,NaN,NaN
7,'Basha',65.0,34.0,78.000,90.0,267.0,NaN,NaN
8,'Charishma',40.0,58.0,90.000,30.0,218.0,NaN,NaN
9,'Name1',NaN,NaN,54.375,NaN,NaN,SVEC,Machine Learning
10,'Name2',NaN,NaN,54.375,NaN,NaN,IIIT,Data Science
11,'Name3',NaN,NaN,54.375,NaN,NaN,Lenora,Python

In [206]:
final_df == np.NaN

    Student Name  Telugu  English  Maths  Science  Total  College  Course
0          False   False    False  False    False  False    False   False
1          False   False    False  False    False  False    False   False
2          False   False    False  False    False  False    False   False
3          False   False    False  False    False  False    False   False
4          False   False    False  False    False  False    False   False
5          False   False    False  False    False  False    False   False
6          False   False    False  False    False  False    False   False
7          False   False    False  False    False  False    False   False
8          False   False    False  False    False  False    False   False
9          False   False    False  False    False  False    False   False
10         False   False    False  False    False  False    False   False
11         False   False    False  False    False  False    False   False

In [207]:
# mean is only for numerical
# mode is only for catgorical

Grouping

In [210]:
final_df.groupby('College').Maths.max()

College
IIIT      54.375
Lenora    54.375
SRKR      87.000
SVCE      54.375
SVEC      54.375
Name: Maths, dtype: float64

In [211]:
final_df.groupby('College').Maths.sum()

College
IIIT      128.375
Lenora     54.375
SRKR      115.000
SVCE       54.375
SVEC       54.375
Name: Maths, dtype: float64

In [212]:
final_df.groupby('College').sum()

         Telugu  English    Maths  Science  Total
College
IIIT      103.0    115.0  128.375     94.0  386.0
Lenora      0.0      0.0   54.375      0.0    0.0
SRKR      121.0     95.0  115.000    157.0  488.0
SVCE       54.0     66.0   54.375     39.0    0.0
SVEC        0.0      0.0   54.375      0.0    0.0

In [214]:
final_df.groupby('College')[['Maths','Science']].max()

          Maths  Science
College
IIIT     54.375     50.0
Lenora   54.375      NaN
SRKR     87.000     90.0
SVCE     54.375     39.0
SVEC     54.375      NaN

In [217]:
final_df.groupby(['Course','College']).Maths.max()

Course            College
Data Science      IIIT       54.375
                  SRKR       87.000
Machine Leaning   IIIT       35.000
Machine Learning  SVEC       54.375
Python            Lenora     54.375
                  SVCE       54.375
Name: Maths, dtype: float64

### Practice
Global Sales Data